---
kind: method
id: M:Autodesk.Revit.DB.ColumnAttachment.SetJustification(Autodesk.Revit.DB.ColumnAttachmentJustification)
source: html/ce661be1-02e4-b35a-bb5a-6987b3675f28.htm
---
# Autodesk.Revit.DB.ColumnAttachment.SetJustification Method

Setter of ColumnAttachmentJustification

## Syntax (C#)
```csharp
public void SetJustification(
	ColumnAttachmentJustification justification
)
```

## Parameters
- **justification** (`Autodesk.Revit.DB.ColumnAttachmentJustification`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration